Maillage_50/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xmin 0;
xmax 0.1;
ymin 0;
ymax 0.1;
zmin -0.01;
zmax 0;

deltax 50;
deltay 50;
deltaz 1;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($deltax $deltay $deltaz) simpleGrading (1 1 1)
);

edges
(

);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (1 0 3 2)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (6 5 1 2)
            (0 4 7 3)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
